import {lambdaFunction} from "./LambdaFunction.js";
import {Function1} from "./Function1.js";

const template = "name (rating місце в ТОП-10 найбільших міст України, населення population чоловік)"

const dataFunc1 = Function1(`
44.38,34.33,Алушта,31440,
49.46,30.17,Біла Церква,200131,
49.54,28.49,Бердичів,87575,#некомент

#
46.49,36.58,#Бердянськ,121692,
49.15,28.41,Вінниця,356665,
45.40,34.29,Джанкой,43343,
48.45,30.12,Житомир,271565,
49.22,31.15,Черкаси,288823,
47.57,33.39,Кривий Ріг,630000,
50.27,30.30,Київ,2962170,
46.58,32.00,Херсон,328360,
50.45,25.20,Луцьк,217103,
49.37,34.33,Полтава,287410,
48.26,35.02,Кам’янське,239474,
49.59,36.14,Харків,1443200,
48.37,22.18,Ужгород,114897,
50.06,29.57,Фастів,48959,
51.13,24.42,Ковель,67989,
48.56,33.38,Олександрія,82285,
49.04,33.28,Світловодськ,45354,
46.46,36.47,Приморськ,12302,
47.39,34.30,Запоріжжя,738324,
50.26,30.37,Ірпінь,87494,
48.37,35.06,Новомосковськ,70830,
50.23,24.11,Самбір,35761,
48.37,22.18,Ужгород,114897,
48.16,37.17,Добропілля,29234,
47.53,35.21,Енергодар,52874,
49.28,34.40,Кременчук,219960,
50.07,32.41,Чигирин,8749,
49.26,26.59,Хмельницький,274452,
48.55,37.29,Бахмут,79477,
48.34,35.50,Павлоград,107742,
46.37,30.44,Одеса,1029049,
48.36,34.44,Дніпро,997754,
49.12,28.36,Могилів-Подільський,31283,
49.27,27.04,Бар,16458,`)

console.log(dataFunc1)
console.log(lambdaFunction(dataFunc1, template))